Autodesk.Revit.DB.Structure.RebarWorkInstructions
Describes how a Free Form Rebar will be fabricated.
Since:
2018
Since:
2018

Autodesk.Revit.DB.Structure.RebarWorkInstructions.Straight
The bar will be delivered as a straight bar to the site and the shape code is of the first straight Rebar Shape loaded into the project (e.g. 00).

Autodesk.Revit.DB.Structure.RebarWorkInstructions.Bent
The bar will be bent in the shop. It will be matched to an existing Rebar Shape. If it can't be matched to an existing one a matching one will be created if it is possible.